; domain
(define
    (domain pacman_hard)
    (:requirements :strips :typing :equality :adl)
    ;; Allow "or", "exists", "forall" in goal descriptions
    ;; Allow "when" in action effects
    ;; Support = as built-in predicate
    (:types
        location
    )

    (:predicates
        (move ?from ?to - location)
        (at ?lo - location)
        (visited ?lo - location)
        (connected ?start ?end - location)
        (isGhost ?lo - location)
        (isFood ?lo - location)
        (isCapsule ?lo - location)
        (invulnerable_step1)
        (invulnerable_step2)   
    )

    
    ;;Eat all the ghosts before eating the last piece of food on the map
    ;;The effect of capsule only last for 2 steps
    (:action move
        :parameters (?from ?to - location)
        :precondition (and 
            (at ?from)
            (connected ?from ?to)
            (or
                (not (isGhost ?to))
                (invulnerable_step1)
                (invulnerable_step2)
            )
            ;;Leave the last piece of food until the final move
            (exists (?lo - location) (isFood ?lo))
            ;;(or 
                
            ;;    (not (isFood ?to));;不吃食物
                
                ;;(and
                ;;    (exists (?lo - location) (isFood ?lo));;There is at least one food on the map before this action
                ;;    (not (exists (?lo - location) (isGhost ?lo)));;沒鬼
                ;;    (not(isFood ?to))
                ;;)
            ;;    (not (exists (?lo - location) (isGhost ?lo)));;There is no ghost on the map
            ;;)          
        )
        :effect (and
            (at ?to)
            (visited ?to)
            (not (at ?from))
            
            (when (isGhost ?to)
                (not (isGhost ?to))
            )

            (when (isFood ?to)
                (not (isFood ?to))
            )
            
            (when (invulnerable_step2)
                (not(invulnerable_step2))
            )
            
            (when (invulnerable_step1)
                (and
                    (not (invulnerable_step1))
                    (invulnerable_step2)
                )
            )
            
            (when (isCapsule ?to)
                (and
                    (not (isCapsule ?to)) ;;Eat the capsule
                    (invulnerable_step1) ;;Become invulnerable for next 2 steps
                )
            )

        )
    )
)

; problem
(define
    (problem pacman-level-1)
    (:domain pacman_hard)

;; problem map
;;  | 1 | 2 | 3 | 4 | 5 |
;; -|---|--- ---|---|---|
;; a| P | _ | _ | G | F |
;; b| _ | C | _ | G | C |
;;  |---|---|---|---|---|

  



    (:objects
        a1 a2 a3 a4 a5 b1 b2 b3 b4 b5 - location
	)
	
	(:init
        (connected a1 a2)
        (connected a2 a1)  
        (connected a2 a3)
        (connected a3 a2)
        (connected a3 a4)
        (connected a4 a3)
        (connected a4 a5)
        (connected a5 a4)
        (connected b1 b2)
        (connected b2 b1)
        (connected b2 b3)
        (connected b3 b2)
        (connected b3 b4)
        (connected b4 b3)
        (connected b4 b5)
        (connected b5 b4)
        (connected a1 b1)
        (connected b1 a1)
        (connected a2 b2)
        (connected b2 a2)
        (connected a3 b3)
        (connected b3 a3)
        (connected a4 b4)
        (connected b4 a4)
        (connected a5 b5)
        (connected b5 a5)
        (isGhost a4)
        (isGhost b4)
        (isFood a5)
        (isCapsule b2)
        (isCapsule b5)
        (at a1)
	)

    (:goal
        
        (and 
            (not(exists (?lo - location) (isFood ?lo)))
            (not(exists (?lo - location) (isGhost ?lo)))
        )
        
        
    
        

	)
)

; plan
1. (move a1 b1)
   deleted: (at a1)
   added: (at b1) (visited b1)
   goals met: 0 of 2
2. (move b1 b2)
   deleted: (at b1) (iscapsule b2)
   added: (at b2) (visited b2) (invulnerable_step1)
   goals met: 0 of 2
3. (move b2 b3)
   deleted: (at b2) (invulnerable_step1)
   added: (at b3) (visited b3) (invulnerable_step2)
   goals met: 0 of 2
4. (move b3 b4)
   deleted: (at b3) (isghost b4) (invulnerable_step2)
   added: (at b4) (visited b4)
   goals met: 0 of 2
5. (move b4 b5)
   deleted: (at b4) (iscapsule b5)
   added: (at b5) (visited b5) (invulnerable_step1)
   goals met: 0 of 2
6. (move b5 b4)
   deleted: (at b5) (invulnerable_step1)
   added: (at b4) (invulnerable_step2)
   goals met: 0 of 2
7. (move b4 a4)
   deleted: (at b4) (isghost a4) (invulnerable_step2)
   added: (at a4) (visited a4)
   goals met: 1 of 2
8. (move a4 a5)
   deleted: (at a4) (isfood a5)
   added: (at a5) (visited a5)
   goals met: 2 of 2
